In [1]:
import pandas as pd

In [2]:
import pandas as pd

# Buat data dummy
df = pd.DataFrame({
    'Nama': ['Ani', 'Budi', 'Cici', 'Deni', 'Eka', 'Fani', 'Gilang', 'Hana', 'Indra', 'Joko'],
    'Nilai_50': [35, 40, 45, 20, 25, 30, 50, 10, 15, 43],
    'Kehadiran': [18, 20, 19, 12, 15, 17, 20, 8, 10, 19],
    'Tugas': [8, 10, 9, 5, 6, 7, 10, 3, 4, 9],
    'Lulus': [1, 1, 1, 0, 0, 0, 1, 0, 0, 1]
})

In [3]:
df

     Nama  Nilai_50  Kehadiran  Tugas  Lulus
0     Ani        35         18      8      1
1    Budi        40         20     10      1
2    Cici        45         19      9      1
3    Deni        20         12      5      0
4     Eka        25         15      6      0
5    Fani        30         17      7      0
6  Gilang        50         20     10      1
7    Hana        10          8      3      0
8   Indra        15         10      4      0
9    Joko        43         19      9      1

In [ ]:

# 1. TL Manual: Ubah nilai ke skala 100
df['Nilai_100'] = df['Nilai_50'].mul(2).add(0)

     Nama  Nilai_50  Kehadiran  Tugas  Lulus  Nilai_100  Nilai_100_Scaled
0     Ani        35         18      8      1         70             0.625
1    Budi        40         20     10      1         80             0.750
2    Cici        45         19      9      1         90             0.875
3    Deni        20         12      5      0         40             0.250
4     Eka        25         15      6      0         50             0.375
5    Fani        30         17      7      0         60             0.500
6  Gilang        50         20     10      1        100             1.000
7    Hana        10          8      3      0         20             0.000
8   Indra        15         10      4      0         30             0.125
9    Joko        43         19      9      1         86             0.825

In [5]:
# 2. TL Scaling: Min-max scaling pada Nilai_100
df['Nilai_100_Scaled'] = (df['Nilai_100'] - df['Nilai_100'].min()) / (df['Nilai_100'].max() - df['Nilai_100'].min())

In [ ]:
y = a - amin / amax  - amin

In [6]:
df

     Nama  Nilai_50  Kehadiran  Tugas  Lulus  Nilai_100  Nilai_100_Scaled
0     Ani        35         18      8      1         70             0.625
1    Budi        40         20     10      1         80             0.750
2    Cici        45         19      9      1         90             0.875
3    Deni        20         12      5      0         40             0.250
4     Eka        25         15      6      0         50             0.375
5    Fani        30         17      7      0         60             0.500
6  Gilang        50         20     10      1        100             1.000
7    Hana        10          8      3      0         20             0.000
8   Indra        15         10      4      0         30             0.125
9    Joko        43         19      9      1         86             0.825

In [7]:
# 3. Korelasi terhadap kelulusan
corr_matrix = df[['Nilai_100', 'Nilai_100_Scaled', 'Kehadiran', 'Tugas', 'Lulus']].corr()

print(df)
print("\nKorelasi terhadap Kelulusan:")
print(corr_matrix['Lulus'].sort_values(ascending=False))

     Nama  Nilai_50  Kehadiran  Tugas  Lulus  Nilai_100  Nilai_100_Scaled
0     Ani        35         18      8      1         70             0.625
1    Budi        40         20     10      1         80             0.750
2    Cici        45         19      9      1         90             0.875
3    Deni        20         12      5      0         40             0.250
4     Eka        25         15      6      0         50             0.375
5    Fani        30         17      7      0         60             0.500
6  Gilang        50         20     10      1        100             1.000
7    Hana        10          8      3      0         20             0.000
8   Indra        15         10      4      0         30             0.125
9    Joko        43         19      9      1         86             0.825

Korelasi terhadap Kelulusan:
Lulus               1.000000
Tugas               0.880366
Nilai_100           0.879145
Nilai_100_Scaled    0.879145
Kehadiran           0.820768
Name: Lulus, dtype: float64

In [9]:
df

     Nama  Nilai_50  Kehadiran  Tugas  Lulus  Nilai_100  Nilai_100_Scaled
0     Ani        35         18      8      1         70             0.625
1    Budi        40         20     10      1         80             0.750
2    Cici        45         19      9      1         90             0.875
3    Deni        20         12      5      0         40             0.250
4     Eka        25         15      6      0         50             0.375
5    Fani        30         17      7      0         60             0.500
6  Gilang        50         20     10      1        100             1.000
7    Hana        10          8      3      0         20             0.000
8   Indra        15         10      4      0         30             0.125
9    Joko        43         19      9      1         86             0.825